src/DataProcessors/КурсыВалютНБРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>КурсыВалютНБРБ</Name>
			<Comment>Загрузка курсов валют с сайта Национального банка Республики Беларусь</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагружатьКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/КурсыВалютНБРБ/Ext/ObjectModule.bsl
Перем ИмяФайла;
Перем мВалютаРегламентированногоУчета Экспорт;

//#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит загрузку курсов и кратностей валют с сайта НБРБ
//
Процедура ЗагрузитьКурсыНБРБ() Экспорт
	Перем HTTP;
	
	Если НачДата = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата")) ИЛИ КонДата = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата")) Тогда
		//Предупреждение("Укажите даты", 10, "Предупрежедние");
		Сообщить("Укажите даты");
		Возврат;
	КонецЕсли;
	
	Если Год(НачДата) <> Год(КонДата) Тогда
		//Предупреждение("Период не в рамках одного года", 10, "Предупрежедние");
		Сообщить("Период не в рамках одного года");
		Возврат;
	КонецЕсли;	
	Если Год(НачДата)<2000 Тогда
		//Предупреждение("Курсы валют на сайте представлены начиная с 2000-го года", 10, "Предупрежедние");
		Сообщить("Курсы валют на сайте представлены начиная с 2000-го года");
		Возврат;
		
	КонецЕсли;
	Если НачалоДня(КонДата) > НачалоДня(ТекущаяДата())Тогда
		//Предупреждение("Конечная дата должна быть не больше текущей", 10, "Предупрежедние");
		Сообщить("Конечная дата должна быть не больше текущей");
		Возврат;
	КонецЕсли; 	
	
	СтруктураПоиска = Новый Структура("Загрузка", Истина);
	МассивВыбранныеВалюты =   СписокВалют.НайтиСтроки(СтруктураПоиска);
	Если МассивВыбранныеВалюты.Количество()>0 Тогда
		РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
		ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
		СерверИсточник = "www.nbrb.by";    
		ОбработкаПолученияФайлов = Обработки.ПолучениеФайловИзИнтернета.Создать();
		Адрес = "statistics/Rates/RatesDaily.asp?yr=";   
		//Адрес = "statistics/rates/archive/";   
		ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
		СоздатьКаталог(ВремКаталог);
		Попытка
			УдалитьФайлы(ВремКаталог,"*.*");
		Исключение
			//Предупреждение("Ошибка блокировки временных файлов", 10, "Предупрежедние");
			Сообщить("Ошибка блокировки временных файлов");
			Возврат;
		КонецПопытки;	
		Стр = "";
	    ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
		СтрокаПараметраПолучения = Адрес +  Строка(Формат(Год(НачДата), "ЧГ = 0"));// + ".xls";
		Если ОбработкаПолученияФайлов.ЗапроситьФайлыССервера(СерверИсточник, СтрокаПараметраПолучения, ИмяВходящегоФайла, HTTP) <> Истина Тогда
			//Предупреждение("Не удалось получить интернет-ресурс. Курсы валют не будут загружены",10, "Предупрежедние"); 
			Сообщить("Не удалось получить интернет-ресурс. Курсы валют не будут загружены");
			Возврат;
		КонецЕсли;
		ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
		Если НЕ ВходящийФайл.Существует() Тогда
			//Предупреждение("Не удалось получить файл данных. Курсы валют не будут загружены",10, "Предупрежедние");    
			Сообщить("Не удалось получить файл данных. Курсы валют не будут загружены");
			Возврат;
		КонецЕсли;	
		//ФормаИндикации = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
		//ФормаИндикации.НаименованиеОбработкиДанных = "Загрузка курсов валют с сайта Национального Банка Беларуси";
		//ФормаИндикации.КомментарийЗначения         = "Загружено:";
		//ФормаИндикации.МаксимальноеЗначение         = 100;
		//ФормаИндикации.Открыть();
		Попытка 
			КурсыXLS = ПолучитьCOMОбъект(ИмяВходящегоФайла);
		Исключение
			//Предупреждение("Возможно открыт файл Excel. Закройте его и повторите попытку.", 10, "Предупрежедние");
			Сообщить("Возможно открыт файл Excel. Закройте его и повторите попытку.");
			//ФормаИндикации.Закрыть();
			Возврат;
		КонецПопытки;
		счСт = 2;
		Страница = КурсыXLS.Sheets(1);
		
		тзВалюта = Новый ТаблицаЗначений;
		тзВалюта.Колонки.Добавить("Обозначение");
		тзВалюта.Колонки.Добавить("Кратность", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15));
        тзВалюта.Колонки.Добавить("НомерЯчейки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(3));
		
		Пока СокрЛП(Страница.Cells(4, счСт).Value) <> "" Цикл
			СтрВалюта = НРег(СокрЛП(Страница.Cells(4, счСт).Value));
			ПозицияПервогоПробела = Найти(СтрВалюта, " ");
			НоваяСтрока = тзВалюта.Добавить();
    		НоваяСтрока.Обозначение = Сред(СтрВалюта, Найти(СтрВалюта, "(") + 1, 3); 
			НоваяСтрока.Кратность =   Сред(СтрВалюта, 1, ПозицияПервогоПробела - 1) ;
			НоваяСтрока.НомерЯчейки =  счСт;
			счСт =счСт  + 1;
		КонецЦикла;
		
		// если баг то если форма индикации открыта то  ее закрыть
		СтруктураПоиска = Новый Структура;	
		НачатьТранзакцию();
		Попытка
			Для сч = 0 по МассивВыбранныеВалюты.ВГраница() Цикл
				ОбозначениеВалюты = НРег(МассивВыбранныеВалюты[сч].Валюта);
				СтруктураПоиска.Вставить("Обозначение", ОбозначениеВалюты);
				НайденноеЗначение =  тзВалюта.НайтиСтроки(СтруктураПоиска);
				Если НайденноеЗначение.количество() > 0 Тогда
					КоличествоДней = Число((НачалоДня(КонДата) - НачалоДня(НачДата)))/(60*60*24)-1;
					КоличествоПозиций =?(КоличествоДней = 0, 1, КоличествоДней);
					Позиция = 0;
					счСтр = 5 + Число((НачалоДня(НачДата) - НачалоДня(Дата(Год(НачДата),1,1)))/(60*60*24));//НачалоДня(НачДата) ;//НачалоДня(НачДата)
					//ФормаИндикации.КомментарийОбработкиДанных   =  МассивВыбранныеВалюты[сч].Валюта.НаименованиеПолное;
					Пока Страница.Cells(счСтр, 1).Value <> Неопределено  Цикл
						ДатаКурса = Страница.Cells(счСтр, 1).Value;
						Если ДатаКурса >= НачДата И ДатаКурса <= КонДата Тогда
							Попытка
								Курс = Число(Страница.Cells(счСтр, НайденноеЗначение[0].НомерЯчейки).Value);
							Исключение
							   Позиция = Позиция  +  100/КоличествоПозиций ;
							   //ФормаИндикации.Значение = Позиция;
							   счСтр =  счСтр  + 1 ;
                               Продолжить;
							КонецПопытки;
							ЗаписьКурсовВалют.Валюта = МассивВыбранныеВалюты[сч].Валюта;
							ЗаписьКурсовВалют.Период = ДатаКурса;
							ЗаписьКурсовВалют.Прочитать();
							ЗаписьКурсовВалют.Валюта    = МассивВыбранныеВалюты[сч].Валюта;
							ЗаписьКурсовВалют.Период    = ДатаКурса;
							ЗаписьКурсовВалют.Курс      = Курс;
							ЗаписьКурсовВалют.Кратность = НайденноеЗначение[0].Кратность;
							ЗаписьКурсовВалют.Записать();
							Позиция = Позиция  +  100/КоличествоПозиций ;  
							//ФормаИндикации.КомментарийЗначения = "Загружено:" ;
							//ФормаИндикации.Значение = Позиция;
						ИначеЕсли  ДатаКурса > КонДата Тогда
							Прервать;
						Конецесли;	
						счСтр =  счСтр  + 1 ;
					КонецЦикла;	
				Иначе	
					Сообщить("Курс для " +  МассивВыбранныеВалюты[сч].Валюта.НаименованиеПолное + " не найден");
				КонецЕсли;
			КонецЦикла; 
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Сообщить("Не удалось записать данные");
			//Если ФормаИндикации.Открыта() Тогда
			//	ФормаИндикации.Закрыть();
			//КонецЕсли;
		КонецПопытки;
		Попытка
			КурсыXLS.Application.Quit();
			УдалитьФайлы(ВремКаталог,"*.*");
		Исключение
		КонецПопытки;
		//Если ФормаИндикации.Открыта() Тогда
		//	 ФормаИндикации.Закрыть();
		//КонецЕсли;
	КонецЕсли;	
КонецПроцедуры // ЗагрузитьКурсыНБРБ()

Процедура ЗагрузитьКурсы()Экспорт
	Если СписокВалют.Количество() = 0 Тогда
		Сообщить("Не заполнен список валют", СтатусСообщения.Важное);
	КонецЕсли;
	
	ЗагрузитьКурсыНБРБ();
КонецПроцедуры

Процедура ЗагрузитьКурсы_XML()Экспорт
	Если СписокВалют.Количество() = 0 Тогда
		Сообщить("Не заполнен список валют", СтатусСообщения.Важное);
	КонецЕсли;
	
	ЗагрузитьКурсыНБРБ_XML();
КонецПроцедуры

// Производит загрузку курсов и кратностей валют с сайта НБРБ
//
Процедура ЗагрузитьКурсыНБРБ_XML() Экспорт
	Перем HTTP;
	
	Если НачДата = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата")) ИЛИ КонДата = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата")) Тогда
		//Предупреждение("Укажите даты", 10, "Предупрежедние");
		Сообщить("Укажите даты");
		Возврат;
	КонецЕсли;
	
	Если Год(НачДата) <> Год(КонДата) Тогда
		//Предупреждение("Период не в рамках одного года", 10, "Предупрежедние");
		Сообщить("Период не в рамках одного года");
		Возврат;
	КонецЕсли;	
	Если Год(НачДата)<2000 Тогда
		//Предупреждение("Курсы валют на сайте представлены начиная с 2000-го года", 10, "Предупрежедние");
		Сообщить("Курсы валют на сайте представлены начиная с 2000-го года");
		Возврат;
	КонецЕсли;
	Если НачалоДня(КонДата) > НачалоДня(ТекущаяДата())Тогда
		//Предупреждение("Конечная дата должна быть не больше текущей", 10, "Предупрежедние");
		Сообщить("Конечная дата должна быть не больше текущей");
		Возврат;
	КонецЕсли; 	
	
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодВалюта");
	ТЗ.Колонки.Добавить("Курс");
	ТЗ.Колонки.Добавить("Кратность");
	
	КоличествоДней = Число((НачалоДня(КонДата) - НачалоДня(НачДата)))/(60*60*24)-1;
	КоличествоПозиций =?(КоличествоДней = 0, 1, КоличествоДней);
	
	//ФормаИндикации = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
	//ФормаИндикации.НаименованиеОбработкиДанных = "Загрузка курсов валют с сайта Национального Банка Беларуси";
	//ФормаИндикации.КомментарийЗначения         = "Загружено:";
	//ФормаИндикации.МаксимальноеЗначение         = 100;
	//ФормаИндикации.Открыть();
	
	НачатьТранзакцию();
	Позиция = 0;
	ДатаС1 = НачДата;
	ДатаПо1 = КонДата;
	АдресXMLНач = "https://www.nbrb.by/Services/XmlExRates.aspx?ondate=";
	Пока НачалоДня(ДатаС1)<=НачалоДня(ДатаПо1) Цикл 
		ТЗ.Очистить();
		АдресXML  = АдресXMLНач+Формат(ДатаС1,"ДФ=MM")+"/"+Формат(ДатаС1,"ДФ=dd")+"/"+Формат(ДатаС1,"ДФ=yyyy") ;
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(АдресXML);
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.ТипУзла =  ТипУзлаXML.НачалоЭлемента Тогда
				
				Если ЧтениеXML.Имя  = "Currency"  Тогда	
					Пока (ЧтениеXML.Прочитать()) И (НЕ((ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента) И (ЧтениеXML.Имя = "Currency"))) Цикл 
						
						Если ЧтениеXML.ТипУзла =  ТипУзлаXML.НачалоЭлемента Тогда
							//Если    ЧтениеXML.Имя = "NumCode" Тогда
							ИмяТекущегоУзла =ЧтениеXML.Имя ;
							
							//КонецЕсли;
						ИначеЕсли ЧтениеXML.ТипУзла =  ТипУзлаXML.Текст Тогда 
							ТекстПараметра = ЧтениеXML.Значение;
							
						ИначеЕсли ЧтениеXML.ТипУзла =  ТипУзлаXML.КонецЭлемента Тогда
							Если ИмяТекущегоУзла = "CharCode" Тогда 
								
								НовСтр = ТЗ.Добавить();
								НовСтр.КодВалюта = НРег(ТекстПараметра);
							ИначеЕсли ИмяТекущегоУзла = "Rate" Тогда  
								НовСтр.Курс = ТекстПараметра;
							ИначеЕсли ИмяТекущегоУзла = "Scale" Тогда  
								НовСтр.Кратность = ТекстПараметра;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//ФормаИндикации.КомментарийОбработкиДанных   =  "Загрузка валют на дату: "+Формат(ДатаС1,"ДФ=dd.MM.yyyy");
		СтруктураПоиска = Новый Структура("Загрузка", Истина);
		МассивВыбранныеВалюты = СписокВалют.НайтиСтроки(СтруктураПоиска);
		Если МассивВыбранныеВалюты.Количество()>0 Тогда
			РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
			ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
			
			//НачатьТранзакцию();
			Попытка
				Для сч = 0 по МассивВыбранныеВалюты.ВГраница() Цикл
					ОбозначениеВалюты = НРег(МассивВыбранныеВалюты[сч].Валюта);
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("КодВалюта", ОбозначениеВалюты);
					НайденноеЗначение = ТЗ.НайтиСтроки(СтруктураПоиска);
					Если НайденноеЗначение.количество() > 0 Тогда
						ЗаписьКурсовВалют.Валюта = МассивВыбранныеВалюты[сч].Валюта;
						ЗаписьКурсовВалют.Период = ДатаС1;
						ЗаписьКурсовВалют.Прочитать();
						ЗаписьКурсовВалют.Валюта    = МассивВыбранныеВалюты[сч].Валюта;
						ЗаписьКурсовВалют.Период    = ДатаС1;
						ЗаписьКурсовВалют.Курс      = НайденноеЗначение[0].Курс;
						ЗаписьКурсовВалют.Кратность = НайденноеЗначение[0].Кратность;
						ЗаписьКурсовВалют.Записать();
					КонецЕсли;
				КонецЦикла;
				//ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Сообщить("Не удалось записать данные");
				//Если ФормаИндикации.Открыта() Тогда
				//	ФормаИндикации.Закрыть();
				//КонецЕсли;
			КонецПопытки;
			
		КонецЕсли;			
		
		Позиция = Позиция  +  100/КоличествоПозиций ;  
		//ФормаИндикации.Значение = Позиция;
		
		ДатаС1 = НачалоДня(ДатаС1+86400);	
	КонецЦикла;
	//Если ФормаИндикации.Открыта() Тогда
	//	ФормаИндикации.Закрыть();
	//КонецЕсли;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ЗагрузитьКурсыНБРБ()

// загрузка с ВебСервиса
Процедура ЗагрузитьКурсы_ВебСервис() Экспорт
	
	ТаблицаВалют = Новый ТаблицаЗначений;
	ТаблицаВалют.Колонки.Добавить("Валюта");
	ТаблицаВалют.Колонки.Добавить("КодВалюты");
	
	Для каждого текСтрока Из СписокВалют Цикл
		Если ТекСтрока.Загрузка Тогда
		
			новаяСтрока = ТаблицаВалют.Добавить();
			новаяСтрока.Валюта = текСтрока.Валюта;
			новаяСтрока.КодВалюты = текСтрока.Валюта.Код;
			
		
		КонецЕсли; 
	КонецЦикла;
	
	ПриЗагрузкеВозниклиОшибки = Ложь;	
	ЗагрузитьКурсыВалютВебСервис(ТаблицаВалют, НачДата, КонДата, ПриЗагрузкеВозниклиОшибки);
	
	Если ПриЗагрузкеВозниклиОшибки Тогда
		
		Сообщить("Курсы не загружены", СтатусСообщения.Важное);

		
	Иначе
	    Сообщить("Курсы загружены", СтатусСообщения.Важное);
	КонецЕсли; 

КонецПроцедуры
 
// Процедура для загрузки курсов валют по определенному периоду с помощью веб-сервисов НБ РБ.
//
// Параметры
// Валюты		- Любая коллекция - со следующими полями:
//					КодВалюты - числовой код валюты
//					Валюта - ссылка на валюту
// НачалоПериодаЗагрузки	- Дата - начало периода загрузки курсов
// ОкончаниеПериодаЗагрузки	- Дата - окончание периода загрузки курсов
//
// Возвращаемое значение:
// Массив состояния загрузки  - каждый элемент - структура с полями
//		Валюта - загружаемая валюта
//		СтатусОперации - завершилась ли загрузка успешно
//		Сообщение - пояснение о загрузке (текст сообщения об ошибке или поясняющее сообщение)
//
Функция ЗагрузитьКурсыВалютВебСервис(знач Валюты,
										знач НачалоПериодаЗагрузки,
										знач ОкончаниеПериодаЗагрузки,
										ПриЗагрузкеВозниклиОшибки = Ложь) Экспорт
										
	СтатусОперации = Истина;
	
	ОдинДень = 0;
	Пока (НачалоДня(НачалоПериодаЗагрузки)+ОдинДень) <= НачалоДня(ОкончаниеПериодаЗагрузки) Цикл
		
		ДатаКурсов = НачалоДня(НачалоПериодаЗагрузки)+ОдинДень;
		
		Прокси = WSСсылки.WSСсылкаНБРБ.СоздатьWSПрокси("https://www.nbrb.by/", "ExRates","ExRatesSoap");
		
		ТипПер =Прокси.ФабрикаXDTO.Пакеты.Получить("https://www.nbrb.by/").Получить("ExRatesDaily");
		Парам = Прокси.ФабрикаXDTO.Создать(ТипПер);
		Парам.onDate = ДатаКурсов; 	
		
		Попытка
			Результат = Прокси.ExRatesDaily(Парам);
		Исключение
			Результат = Неопределено;
		КонецПопытки;  
		
		Если Результат <> Неопределено Тогда
			Ответ = Результат.ExRatesDailyResult;	
			
			XDTO = Ответ.diffgram.NewDataSet;
			Список = XDTO.DailyExRatesOnDate;
			
			ОбработатьСписокСКурсамиВалютВебСервис(Список, НачалоПериодаЗагрузки, ОдинДень, Валюты);
			ПриЗагрузкеВозниклиОшибки = Ложь;
		Иначе
			ПриЗагрузкеВозниклиОшибки = Истина;
			СтатусОперации = Ложь;
			СообщениеОбОшибке= НСтр("ru = 'Ошибка при получении курсов валют:'")
								  + Символы.ПС + "Проверьте подключение к интернету.";
		КонецЕсли;
		// увеличим счетчик
		ОдинДень = ОдинДень + 60*60*24;						   
	КонецЦикла;
	
	Возврат СтатусОперации;
	
КонецФункции

Функция ОбработатьСписокСКурсамиВалютВебСервис(Список, НачДата, ОдинДень, Валюты)
	
	ТаблицаКурсы = Новый ТаблицаЗначений;
	ТаблицаКурсы.Колонки.Добавить("Период"   , ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаКурсы.Колонки.Добавить("Валюта");
	ТаблицаКурсы.Колонки.Добавить("Кратность", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,0));
	ТаблицаКурсы.Колонки.Добавить("Курс"     , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,4));
	
	ПустаяВалюта = Справочники.Валюты.ПустаяСсылка();
	
	// читаем файл
	ВсегоЭлементов=Список.Количество();
	
	Для а=0 По ВсегоЭлементов-1 Цикл
		ТекЭлемент = Список.Получить(а);
						
		Код = ТекЭлемент.Cur_Code;
		Валюта = Справочники.Валюты.НайтиПоКоду(Код);
		
		Если Валюта <> ПустаяВалюта Тогда
			ПараметрыОтбора = Новый Структура("КодВалюты", Код);
			МассивВалют = Валюты.НайтиСтроки(ПараметрыОтбора);
			Если МассивВалют.Количество() > 0 Тогда
				НоваяСтрока = ТаблицаКурсы.Добавить();
				НоваяСтрока.Период = (НачалоДня(НачДата)+ОдинДень);
				НоваяСтрока.Валюта = Валюта;
				НоваяСтрока.Кратность = ТекЭлемент.Cur_Scale;
				НоваяСтрока.Курс = ТекЭлемент.Cur_OfficialRate;
			КонецЕсли;                    			
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКурсы Цикл
		// запись курсов
		
			ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
			
			ЗаписьКурсовВалют.Валюта    = СтрокаТаблицы.Валюта;
			ЗаписьКурсовВалют.Период    = СтрокаТаблицы.Период;
			ЗаписьКурсовВалют.Курс      = СтрокаТаблицы.Курс;
			ЗаписьКурсовВалют.Кратность = СтрокаТаблицы.Кратность;
			ЗаписьКурсовВалют.Записать();
	КонецЦикла;

	Если ТаблицаКурсы.Количество() > 0 Тогда
		Сообщить("Загружены курсы валют за "+Формат((НачалоДня(НачДата)+ОдинДень), "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
КонецФункции


Процедура ЗагрузитьКурсы_API()  Экспорт

	Попытка
		Соединение = Новый HTTPСоединение("www.nbrb.by",443,,,,,Новый ЗащищенноеСоединениеOpenSSL(),Ложь);
	Исключение
		Сообщить("Не удалось установить соединение" + Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
	КонецПопытки;
	
	ТаблицаВалют = Новый ТаблицаЗначений;
	ТаблицаВалют.Колонки.Добавить("Валюта");
	
	Для каждого ТекСтрока Из СписокВалют Цикл
		Если ТекСтрока.Загрузка Тогда
			НоваяСтрока = ТаблицаВалют.Добавить();
			НоваяСтрока.Валюта = ТекСтрока.Валюта;
		КонецЕсли; 
	КонецЦикла;
	
	ТаблицаКурсы = Новый ТаблицаЗначений;
	ТаблицаКурсы.Колонки.Добавить("Период"   , ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаКурсы.Колонки.Добавить("Валюта");
	ТаблицаКурсы.Колонки.Добавить("Кратность", ПолучитьОписаниеТиповЧисла(10,0));
	ТаблицаКурсы.Колонки.Добавить("Курс"     , ПолучитьОписаниеТиповЧисла(10,4));
	
	ПЗ = Новый Соответствие;
	ДатаКурсов = НачалоДня(НачДата);
	Пока (ДатаКурсов) <= НачалоДня(КонДата) Цикл
		ТаблицаКурсы.Очистить();
		ТекстЗапроса = "/api/exrates/rates?ondate=" + Формат(ДатаКурсов,"ДФ=yyyy-MM-d") + "&periodicity=0";
		HTTPЗапрос = Новый HTTPЗапрос(ТекстЗапроса,ПЗ);
		Результат = Соединение.Получить(HTTPЗапрос);
		Стр = Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Если ЗначениеЗаполнено(Стр) Тогда
			СтрПоиск = Стр;
			Пока Лев(СтрПоиск,1) <> "]" Цикл
				НачСимвол = Найти(СтрПоиск,"{");
				КонСимвол = Найти(СтрПоиск,"}");
				СтрВал = Сред(СтрПоиск,НачСимвол,КонСимвол - НачСимвол + 1);
				НачВалюта = Найти(СтрВал,"Cur_Abbreviation");
				БуквКод = Сред(СтрВал,НачВалюта + 19,3);
				Валюта = Справочники.Валюты.НайтиПоНаименованию(БуквКод);
				Если ЗначениеЗаполнено(Валюта) Тогда
					ПараметрыОтбора = Новый Структура("Валюта", Валюта);
					МассивВалют = ТаблицаВалют.НайтиСтроки(ПараметрыОтбора);
					Если МассивВалют.Количество() > 0 Тогда
						НачКратность = Найти(СтрВал,"Cur_Scale");
						КонКратность = Найти(СтрВал,"Cur_Name");
						Кратность = Число(Сред(СтрВал,НачКратность + 11,КонКратность - НачКратность - 13));
						НачКурс = Найти(СтрВал,"Cur_OfficialRate");
						Курс = Число(Сред(СтрВал,НачКурс + 18,КонСимвол - 19 - НачКурс));
						
						НоваяСтрока = ТаблицаКурсы.Добавить();
						НоваяСтрока.Период = ДатаКурсов;
						НоваяСтрока.Валюта = Валюта;
						НоваяСтрока.Кратность = Кратность;
						НоваяСтрока.Курс = Курс;
					КонецЕсли;
				КонецЕсли;
				СтрПоиск = Сред(СтрПоиск,КонСимвол + 1);
			КонецЦикла;
			
			РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
			
			Для Каждого СтрокаТаблицы Из ТаблицаКурсы Цикл
				// запись курсов
				
				ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
				
				ЗаписьКурсовВалют.Валюта    = СтрокаТаблицы.Валюта;
				ЗаписьКурсовВалют.Период    = СтрокаТаблицы.Период;
				ЗаписьКурсовВалют.Курс      = СтрокаТаблицы.Курс;
				ЗаписьКурсовВалют.Кратность = СтрокаТаблицы.Кратность;
				ЗаписьКурсовВалют.Записать();
			КонецЦикла;
			
			Если ТаблицаКурсы.Количество() > 0 Тогда
				Сообщить("Загружены курсы валют за "+Формат(ДатаКурсов, "ДФ=dd.MM.yyyy"), СтатусСообщения.Важное);
			КонецЕсли;
		Иначе
			Сообщить("Курсы не загружены за " + Формат(ДатаКурсов,"ДФ=dd.MM.yyyy"), СтатусСообщения.Важное);
		КонецЕсли;
		ДатаКурсов = ДатаКурсов + 86400;
	КонецЦикла;


КонецПроцедуры // ЗагрузитьКурсы_API(()
// Служебная функция, предназначенная для получения описания типов числа, заданной разрядности.
// 
// Параметры:
//  Разрядность 			- число, разряд числа.
//  РазрядностьДробнойЧасти - число, разряд дробной части.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для числа указанной разрядности.
//
Функция ПолучитьОписаниеТиповЧисла(Разрядность,РазрядностьДробнойЧасти=0) 

	Массив = Новый Массив;

	Массив.Добавить(Тип("Число"));
	КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность,РазрядностьДробнойЧасти);

	Возврат Новый ОписаниеТипов(Массив, КвалификаторЧисла);

КонецФункции // ПолучитьОписаниеТиповЧисла() 

// Служебная функция, предназначенная для получения описания типов даты
// 
// Параметры:
//  ЧастиДаты - системное перечисление ЧастиДаты.
// 
Функция ПолучитьОписаниеТиповДаты(ЧастиДаты) 

	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));

	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты);

	Возврат Новый ОписаниеТипов(Массив, , , КвалификаторДаты);

КонецФункции // ПолучитьОписаниеТиповДаты() 

// Процедура заполняет табличную часть СписокВалют.
// Список валют и текущих курсов валют в ИБ.
//
Процедура ОбновитьСписокВалют() Экспорт
	
	СписокВалют.Очистить();
	
	Запрос = Новый Запрос;
	мВалютРегламентированногоучета = константы.ВалютаРегламентированногоУчета.Получить();
	запрос.УстановитьПараметр("мвалреглучета",мВалютРегламентированногоучета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Валюты.Ссылка,
	               |	КурсыВалют.Период КАК ДатаКурса,
	               |	КурсыВалют.Курс
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалют
	               |		ПО (КурсыВалют.Валюта = Валюты.Ссылка)
	               |ГДЕ
	               |	НЕ Валюты.ПометкаУдаления
	               |	И НЕ Валюты.Ссылка = &мвалреглучета" ;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Валюта = СписокВалют.Добавить();
		
		Валюта.Валюта = Выборка.Ссылка;
		Валюта.ДатаКурса = Выборка.ДатаКурса;
		Валюта.Курс = Выборка.Курс;
		
		Если ЗначениеЗаполнено(Валюта.ДатаКурса) И НачалоДня(Валюта.ДатаКурса) < НачалоДня(ТекущаяДата()) Тогда
			Валюта.Загрузка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокВалют()


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяФайла = "Curses.xls";  

//#КонецЕсли

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
